Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GS606.h
#define _CMPCON4_EXTREF_POSITION                 0x00000005
#define _CMPCON4_EXTREF_MASK                     0x00000020
#define _CMPCON4_EXTREF_LENGTH                   0x00000001

#define _CMPCON4_INSEL_POSITION                  0x00000006
#define _CMPCON4_INSEL_MASK                      0x000000C0
#define _CMPCON4_INSEL_LENGTH                    0x00000002

#define _CMPCON4_DACOE_POSITION                  0x00000008
#define _CMPCON4_DACOE_MASK                      0x00000100
#define _CMPCON4_DACOE_LENGTH                    0x00000001

#define _CMPCON4_CMPSIDL_POSITION                0x0000000D
#define _CMPCON4_CMPSIDL_MASK                    0x00002000
#define _CMPCON4_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON4_CMPON_POSITION                  0x0000000F
#define _CMPCON4_CMPON_MASK                      0x00008000
#define _CMPCON4_CMPON_LENGTH                    0x00000001

#define _CMPCON4_INSEL0_POSITION                 0x00000006
#define _CMPCON4_INSEL0_MASK                     0x00000040
#define _CMPCON4_INSEL0_LENGTH                   0x00000001

#define _CMPCON4_INSEL1_POSITION                 0x00000007
#define _CMPCON4_INSEL1_MASK                     0x00000080
#define _CMPCON4_INSEL1_LENGTH                   0x00000001

#define _CMPDAC4_CMREF_POSITION                  0x00000000
#define _CMPDAC4_CMREF_MASK                      0x000003FF
#define _CMPDAC4_CMREF_LENGTH                    0x0000000A

#define _CMPDAC4_CMREF0_POSITION                 0x00000000
#define _CMPDAC4_CMREF0_MASK                     0x00000001
#define _CMPDAC4_CMREF0_LENGTH                   0x00000001

#define _CMPDAC4_CMREF1_POSITION                 0x00000001
#define _CMPDAC4_CMREF1_MASK                     0x00000002
#define _CMPDAC4_CMREF1_LENGTH                   0x00000001

#define _CMPDAC4_CMREF2_POSITION                 0x00000002
#define _CMPDAC4_CMREF2_MASK                     0x00000004
#define _CMPDAC4_CMREF2_LENGTH                   0x00000001

#define _CMPDAC4_CMREF3_POSITION                 0x00000003
#define _CMPDAC4_CMREF3_MASK                     0x00000008
#define _CMPDAC4_CMREF3_LENGTH                   0x00000001

#define _CMPDAC4_CMREF4_POSITION                 0x00000004
#define _CMPDAC4_CMREF4_MASK                     0x00000010
#define _CMPDAC4_CMREF4_LENGTH                   0x00000001

#define _CMPDAC4_CMREF5_POSITION                 0x00000005
#define _CMPDAC4_CMREF5_MASK                     0x00000020
#define _CMPDAC4_CMREF5_LENGTH                   0x00000001

#define _CMPDAC4_CMREF6_POSITION                 0x00000006
#define _CMPDAC4_CMREF6_MASK                     0x00000040
#define _CMPDAC4_CMREF6_LENGTH                   0x00000001

#define _CMPDAC4_CMREF7_POSITION                 0x00000007
#define _CMPDAC4_CMREF7_MASK                     0x00000080
#define _CMPDAC4_CMREF7_LENGTH                   0x00000001

#define _CMPDAC4_CMREF8_POSITION                 0x00000008
#define _CMPDAC4_CMREF8_MASK                     0x00000100
#define _CMPDAC4_CMREF8_LENGTH                   0x00000001

#define _CMPDAC4_CMREF9_POSITION                 0x00000009
#define _CMPDAC4_CMREF9_MASK                     0x00000200
#define _CMPDAC4_CMREF9_LENGTH                   0x00000001

#define _C1CTRL1_WIN_POSITION                    0x00000000
#define _C1CTRL1_WIN_MASK                        0x00000001
#define _C1CTRL1_WIN_LENGTH                      0x00000001

#define _C1CTRL1_CANCAP_POSITION                 0x00000003
#define _C1CTRL1_CANCAP_MASK                     0x00000008
#define _C1CTRL1_CANCAP_LENGTH                   0x00000001

#define _C1CTRL1_OPMODE_POSITION                 0x00000005
#define _C1CTRL1_OPMODE_MASK                     0x000000E0
#define _C1CTRL1_OPMODE_LENGTH                   0x00000003

#define _C1CTRL1_REQOP_POSITION                  0x00000008
#define _C1CTRL1_REQOP_MASK                      0x00000700
#define _C1CTRL1_REQOP_LENGTH                    0x00000003

#define _C1CTRL1_ABAT_POSITION                   0x0000000C
#define _C1CTRL1_ABAT_MASK                       0x00001000
#define _C1CTRL1_ABAT_LENGTH                     0x00000001

#define _C1CTRL1_CSIDL_POSITION                  0x0000000D
#define _C1CTRL1_CSIDL_MASK                      0x00002000
#define _C1CTRL1_CSIDL_LENGTH                    0x00000001

#define _C1CTRL1_OPMODE0_POSITION                0x00000005
#define _C1CTRL1_OPMODE0_MASK                    0x00000020
#define _C1CTRL1_OPMODE0_LENGTH                  0x00000001

#define _C1CTRL1_OPMODE1_POSITION                0x00000006
#define _C1CTRL1_OPMODE1_MASK                    0x00000040
#define _C1CTRL1_OPMODE1_LENGTH                  0x00000001

#define _C1CTRL1_OPMODE2_POSITION                0x00000007
#define _C1CTRL1_OPMODE2_MASK                    0x00000080
#define _C1CTRL1_OPMODE2_LENGTH                  0x00000001

#define _C1CTRL1_REQOP0_POSITION                 0x00000008
#define _C1CTRL1_REQOP0_MASK                     0x00000100
#define _C1CTRL1_REQOP0_LENGTH                   0x00000001

#define _C1CTRL1_REQOP1_POSITION                 0x00000009
#define _C1CTRL1_REQOP1_MASK                     0x00000200
#define _C1CTRL1_REQOP1_LENGTH                   0x00000001

#define _C1CTRL1_REQOP2_POSITION                 0x0000000A
#define _C1CTRL1_REQOP2_MASK                     0x00000400
#define _C1CTRL1_REQOP2_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT_POSITION                  0x00000000
#define _C1CTRL2_DNCNT_MASK                      0x0000001F
#define _C1CTRL2_DNCNT_LENGTH                    0x00000005

#define _C1CTRL2_DNCNT0_POSITION                 0x00000000
#define _C1CTRL2_DNCNT0_MASK                     0x00000001
#define _C1CTRL2_DNCNT0_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT1_POSITION                 0x00000001
#define _C1CTRL2_DNCNT1_MASK                     0x00000002
#define _C1CTRL2_DNCNT1_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT2_POSITION                 0x00000002
#define _C1CTRL2_DNCNT2_MASK                     0x00000004
#define _C1CTRL2_DNCNT2_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT3_POSITION                 0x00000003
#define _C1CTRL2_DNCNT3_MASK                     0x00000008
#define _C1CTRL2_DNCNT3_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT4_POSITION                 0x00000004
#define _C1CTRL2_DNCNT4_MASK                     0x00000010
#define _C1CTRL2_DNCNT4_LENGTH                   0x00000001

#define _C1VEC_ICODE_POSITION                    0x00000000
#define _C1VEC_ICODE_MASK                        0x0000007F
#define _C1VEC_ICODE_LENGTH                      0x00000007

#define _C1VEC_FILHIT_POSITION                   0x00000008
#define _C1VEC_FILHIT_MASK                       0x00001F00
#define _C1VEC_FILHIT_LENGTH                     0x00000005

#define _C1VEC_ICODE0_POSITION                   0x00000000
#define _C1VEC_ICODE0_MASK                       0x00000001
#define _C1VEC_ICODE0_LENGTH                     0x00000001

#define _C1VEC_ICODE1_POSITION                   0x00000001
#define _C1VEC_ICODE1_MASK                       0x00000002
#define _C1VEC_ICODE1_LENGTH                     0x00000001

